
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.kstp_network will be created
  + resource "azurerm_virtual_network" "kstp_network" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "kstp-network"
      + resource_group_name = "kstp-grp"
      + subnet              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @bjakym, Action: `pull_request`, Working Directory: `infra/kstp/102-virtual-network`, Workflow: `Prepare Terraform`*
